#include <stdint.h>
#include "Password.h"
#include "usb.h"
#include "kb.h"

//==============================================================================
//    Функция чтения 4 байтного числа в памяти EEPROM
//    Возврат:        число типа uint32_t
//    Параметры:      uint8_t addr - начальный адресс в памяти EEPROM
//==============================================================================
/*uint32_t EEPROM_u32_read(uint8_t addr) {
  uint8_t raw[4], i;
  uint32_t *p = (uint32_t*)&raw;
  for(i = 0; i < 4; i++) raw[i] = EEPROM_Read(addr+i);
  return *p;
}*/
//==============================================================================
//    Функция записи 4 байтного числа в память EEPROM
//    Возврат:        void
//    Параметры:      uint8_t addr - начальный адресс в памяти EEPROM
//                    uint32_t num - 4 байтное число
//==============================================================================
/*void EEPROM_u32_write(uint8_t addr, uint32_t num) {
  uint8_t i;
  for(i = 0; i < 4; i++){
     EEPROM_Write(addr+i, *((uint8_t*)num + i));
  }
}*/
//==============================================================================
//    Функция автоматического ввода пароля
//    Возврат:        void
//    Параметры:      uint8_t stAdres - начальный адресс в памяти EEPROM
//==============================================================================
void SendPassword (uint8_t stAdres){
  uint8_t i = 0,
          bufKey = 0;                                     //буфер считаной кнопки с EEPROM

  for(i = 0; i < PASS_BUFF_SIZE; i++){                   //Цикл вывода пароля в USB
      bufKey = EEPROM_read(stAdres + i);                 //Считывается байт с EEPROM
      if(bufKey == 0xFF) return;                         //Если нет пароля выходим с под программы
      else if(bufKey == '\0'){                           //Если обнаружен конец пароля два раза жмякается кнопка ENTER
        SendKey(KEY_ENTER, 0);
        delay_ms(100);
        SendNoKeys();
        delay_ms(10);
        SendKey(KEY_ENTER, 0);
        delay_ms(100);
        break;
      } else {                                           //в противном случае происходит вывод пароля
        SendKey((bufKey & 0x7F), ((bufKey & 0x80)>>6));  //Отпрявляется код клавиши и ее модификатор SHIFT
        delay_ms(30);
        SendNoKeys();                                    //нужно чтобы система определила отпускание кнопки
        delay_ms(30);
      }
  }
  SendNoKeys();
}

//==============================================================================
//    Функция записи пароля в память EEPROM
//    Возврат:        void
//    Параметры:      uint8_t *pass - массив кейкодов пароля и последние 4 байта
//                                    флаги зажатия клавиши SHIFT
//                    uint8_t len - количество символов для записи (не более 32)
//                    uint8_t stAddr - начальный адресс в памяти EEPROM
//==============================================================================
void EEPROM_SavePassword (uint8_t *pass, uint8_t len, uint8_t stAddr){
 uint8_t i;

 for(i=0; i<len; i++){                          //Просто в цикле пишем в EEPROM
    EEPROM_write(stAddr+i, pass[i]);            //символы пароля
    delay_us(100);
 }
 EEPROM_write(stAddr+len, '\0');
}
//==============================================================================
//    Функция стирания пароля в памяти EEPROM
//    Возврат:        void
//    Параметры:      uint8_t stAddr - начальный адресс в памяти EEPROM
//    Описание:       Стирает ячейки памяти EEPROM записуя туда 0xFF
//==============================================================================
void EEPROM_ClearPassword (uint8_t stAddr, uint8_t len){
   uint8_t i;
   for(i=0; i<len; i++){                        //Просто в цикле стираем в EEPROM
      EEPROM_write(stAddr+i, 0xFF);
      delay_us(100);
   }
}