#include <stdint.h>
#include "usb.h"

uint8_t readbuff[64] absolute 0x500;          //Буфер приема данных от USB
uint8_t writebuff[64] absolute 0x540;         //буфер передачи данных USB
uint8_t reserved=0;                           //Зарезервированая переменная для будущего использования

//==============================================================================
//    Функция определения конфигурации USB и иницыализация флагов
//    Возврат:        void
//    Параметры:      void
//==============================================================================
void USB_StateInit (void){
   /////////////////////////////////////////////////////////////////
       //////////////Определение состояние USB//////////////////////////
       //   _USB_DEV_STATE_CONFIGURED
       //   _USB_DEV_STATE_DETACHED
       //   _USB_DEV_STATE_ATTACHED
       //   _USB_DEV_STATE_POWERED
       //   _USB_DEV_STATE_DEFAULT
       //   _USB_DEV_STATE_ADDRESS
       //   _USB_DEV_STATE_SUSPEND
       if(USBDev_GetDeviceState() == _USB_DEV_STATE_CONFIGURED){
          USBFlags.if_conf = 1;                   //Если USB сконфигурирован устанавливаем флаг нормальной работы
          USBDev_SetReceiveBuffer(1, readbuff);   //Переинициализация буффера приема данных HID
       } else {
          USBFlags.if_conf = 0;                   //Если USB в режиме приостановлен - сбрасываем флаг работы USB
          delay_ms(10);                           //Ждем 10мс чтобы точно определить все ли устаканилось
       }
}
//==============================================================================
//    Переиницыализация приемного буфера для USB
//    Возврат:        void
//    Параметры:      void
//==============================================================================
void USB_ReceiveBuffSet (void){
   USBDev_SetReceiveBuffer(1, readbuff);
}
//==============================================================================
//    Функция отправки кодов клавишь по USB
//    Возврат:        uint8_t - колличество зажатых кнопок
//    Параметры:      void
//==============================================================================
uint8_t SendKeys (uint8_t *keys, uint8_t modifier){
   uint8_t i = 0,
           cnt = 0;
      writebuff[0] = modifier;
      writebuff[1] = reserved;
      for(i=0; i<=5; i++){
         if(keys[i] != 0) cnt++;
         writebuff[i+2]=keys[i];
      }
      USBDev_HIDWrite(1,writebuff,8);
   return cnt;
}
//==============================================================================
//    Передача "Все кнопки отпущенны" USB
//    Возврат:        void
//    Параметры:      void
//==============================================================================
void SendNoKeys (void){
    memset(writebuff, 0, 8);
    USBDev_HIDWrite(1,writebuff,8);
}
//==============================================================================
//    Функция отправки кодов клавишь по USB
//    Возврат:        void
//    Параметры:      uint8_t key - сканкод клавиши на передачу
//                    uint8_t modif - модификатор
//==============================================================================
void SendKey (uint8_t key, uint8_t modifier){
      writebuff[0] = modifier;
      writebuff[1] = reserved;
      writebuff[2] = key;
      memset(writebuff+3, 0, 5);
      USBDev_HIDWrite(1,writebuff,8);       //Непосредственно сама передача
}
//==============================================================================
//    Функция получения состояния светодиодов клавиатуры USB
//    Возврат:        uint8_t - маска светодиодов
//    Параметры:      void
//==============================================================================
uint8_t USB_GetLEDs (void){
      uint8_t leds;
      leds = (readbuff[0] & 0x07)<<1;
      if((leds & 0x08) == 8) leds = (leds & 0x07)|0x01;
      
      return leds;
}