#include <stdint.h>
#include "usb.h"
#include "kb.h"

uint8_t readbuff[64] absolute 0x500;          //Буфер приема данных от USB
uint8_t writebuff[64] absolute 0x540;         //буфер передачи данных USB
uint8_t reserved=0;                           //Зарезервированая переменная для будущего использования

struct SFLG{                                  //Структура флагов, аналогичная инициализация находится в файле kb.c
   unsigned kb_mode: 1;                       //0 = стандартная клавиатура, 1 = консоль
   unsigned usb_on: 1;                        //1 = usb отключен, 0 = usb включен
   unsigned kbBtn_mode: 1;                    //0 = 10 кнопок, 1 = 11 кнопок
   unsigned wr_pass: 1;                       //1 = активация режима записи пароля
   unsigned if_pc: 1;                         //0 = компьютер 1 = плата
} sysFlags at CVRCON;                         //Флаги сохряняются в регистре CVRCON настроек компаратора который не используется

//==============================================================================
//    Функция определения конфигурации USB и иницыализация флагов
//    Возврат:        void
//    Параметры:      void
//==============================================================================
void USB_StateInit (void){
   /////////////////////////////////////////////////////////////////
       //////////////Определение состояние USB//////////////////////////
       //   _USB_DEV_STATE_CONFIGURED
       //   _USB_DEV_STATE_DETACHED
       //   _USB_DEV_STATE_ATTACHED
       //   _USB_DEV_STATE_POWERED
       //   _USB_DEV_STATE_DEFAULT
       //   _USB_DEV_STATE_ADDRESS
       //   _USB_DEV_STATE_SUSPEND
       if(USBDev_GetDeviceState() == _USB_DEV_STATE_CONFIGURED){
          USBFlags.if_conf = 1;                   //Если USB сконфигурирован устанавливаем флаг нормальной работы
          USBDev_SetReceiveBuffer(1, readbuff);   //Переинициализация буффера приема данных HID
       } else {
          USBFlags.if_conf = 0;                   //Если USB в режиме приостановлен - сбрасываем флаг работы USB
          delay_ms(10);                           //Ждем 10мс чтобы точно определить все ли устаканилось
       }
}
//==============================================================================
//    Переиницыализация приемного буфера для USB
//    Возврат:        void
//    Параметры:      void
//==============================================================================
void USB_ReceiveBuffSet (void){
   USBDev_SetReceiveBuffer(1, readbuff);
}
//==============================================================================
//    Функция отправки кодов клавишь по USB
//    Возврат:        uint8_t - колличество зажатых кнопок
//    Параметры:      void
//==============================================================================
uint8_t SendKeys (uint8_t *keys, uint8_t modifier){
   uint8_t i,
           cnt = 0;
      memset(writebuff, 0, 8);
      writebuff[0] = modifier;
      writebuff[1] = reserved;
      for(i=0; i<=5; i++){
         if(keys[i] != 0) cnt++;
         if(sysFlags.kb_mode == 1){                                //Если консоль то
            if(keys[i] >= KEY_F1 && keys[i] <= KEY_F12)            //Проверяем что клавиша в диапазоне консоли
                writebuff[i+2] = RemarkConsole(keys[i]);           //делаем переназначения
         } else
            writebuff[i+2]=keys[i];
      }
      USBDev_HIDWrite(1,writebuff,8);
   return cnt;
}
//==============================================================================
//    Передача "Все кнопки отпущенны" USB
//    Возврат:        void
//    Параметры:      void
//==============================================================================
void SendNoKeys (void){
    memset(writebuff, 0, 8);
    USBDev_HIDWrite(1,writebuff,8);
}
//==============================================================================
//    Функция отправки кодов клавишь по USB
//    Возврат:        void
//    Параметры:      uint8_t key - сканкод клавиши на передачу
//                    uint8_t modif - модификатор
//==============================================================================
void SendKey (uint8_t key, uint8_t modifier){
      writebuff[0] = modifier;
      writebuff[1] = reserved;
      writebuff[2] = key;
      memset(writebuff+3, 0, 5);
      USBDev_HIDWrite(1,writebuff,8);       //Непосредственно сама передача
}
//==============================================================================
//    Функция получения состояния светодиодов клавиатуры USB
//    Возврат:        uint8_t - маска светодиодов
//    Параметры:      void
//==============================================================================
uint8_t USB_GetLEDs (void){
      uint8_t leds;
      leds = (readbuff[0] & 0x07)<<1;
      if((leds & 0x08) == 8) leds = (leds & 0x07)|0x01;
      
      return leds;
}